{"pages":[],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2019/01/12/hello-world/"},{"title":"Tutorial for Hadoop 1 -- single node","text":"This tutorial is to build a single node Hadoop platform on a ubuntu vm. 1.Install Java(Oracle JDK8)123456$ sudo add-apt-repository ppa:webupd8team/java$ sudo apt-get update$ sudo apt-get install oracle-java8-installer$ java -version #check the version of jdk 2.Install HadoopFind the version of Hadoop you want to install from Apache Hadoop Releases page and select the binary file and copy its link, then use shell to install as follow(here we choose the 3.2.0 for example): 1$ wget https://www-eu.apache.org/dist/hadoop/common/hadoop-3.2.0/hadoop-3.2.0.tar.gz Then extract the file and move it to /usr/local directory 12$ tar -xzvf hadoop-3.2.0.tar.gz$ sudo mv hadoop-3.2.0 /usr/local/hadoop 3.Configuring Hadoop’s Java HomeCheck the default Java path using following shell: 1$ readlink -f /usr/bin/java | sed \"s:bin/java::\" Then to configure the Hadoop environment by edit the Hadoop-env.sh 1$ sudo nano /usr/local/hadoop/etc/hadoop/hadoop-env.sh You could use vim if you familiar with vim to edit. Then modify this file in one of the following options: 12345678#two options both add one line after #export JAVA_HOME=#method 1:set static valueexport JAVA_HOME=/usr/lib/jvm/java-8-oracle/jre/#method 2: set dynamic valueexport JAVA_HOME=$(readlink -f /usr/bin/java | sed \"s:bin/java::\") 4.Runing HadoopNow we should be able to run Hadoop: 1$ /usr/local/hadoop/bin/hadoop Or you can add hadoop to your PATH to easily run by editing the profile 1234567$ sudo nano /etc/profile#then add one line at the end of this fileexport PATH=$PATH:/usr/local/hadoop/bin#save and exit, then run following shell to make this file take effect$ source /etc/profile","link":"/2019/02/06/Tutorial for Hadoop(1) single node/"}],"tags":[{"name":"Cloud Computing","slug":"Cloud-Computing","link":"/tags/Cloud-Computing/"}],"categories":[]}